"""
✅ Задание 1: Создание и вывод
Создай словарь с информацией о книге:

название: "1984"

автор: "Джордж Оруэлл"

год: 1949
Выведи весь словарь.
"""
from selene.common.predicate import equals


def primer_1():
    book = {
        'Название': '1984',
        'Автор': 'Джордж Оруэлл',
        'Год': '1949'
    }
    for key in book:
        print(f"{key} : {book[key]}")


"""
✅ Задание 2: Обращение к значению
Дан словарь:

student = {"имя": "Мария", "оценка": 5, "курс": 2}
Выведи значение по ключу "оценка".
"""


def primer_2():
    student = {"имя": "Мария", "оценка": 5, "курс": 2}
    print(student.get('оценка'))


"""
✅ Задание 3: Добавление пары
В словарь:

user = {"логин": "admin", "пароль": "1234"}
Добавь ключ "email" со значением "admin@example.com".
"""


def primer_3():
    user = {"логин": "admin", "пароль": "1234"}
    user['email'] = 'admin@example.com'
    for key in user:
        print(f"{key} : {user[key]}")


"""
✅ Задание 4: Изменение значения
В словаре:

product = {"название": "Хлеб", "цена": 40}
Измени цену на 45.
"""


def primer_4():
    product = {"название": "Хлеб", "цена": 40}
    product["цена"] = 45
    for key in product:
        print(f"{key} : {product[key]}")


"""
✅ Задание 5: Удаление ключа
Из словаря:

car = {"марка": "Toyota", "год": 2020, "цвет": "синий"}
Удалите ключ "цвет".
"""


def primer_5():
    car = {"марка": "Toyota", "год": 2020, "цвет": "синий"}
    del car['цвет']
    for key in car:
        print(f"{key} : {car[key]}")


"""
✅ Задание 6: Перебор ключей и значений
Дан словарь:

person = {"имя": "Анна", "город": "Москва", "возраст": 30}
Выведи каждую пару ключ: значение на новой строке. Используй цикл for.
"""


def primer_6():
    person = {"имя": "Анна", "город": "Москва", "возраст": 30}
    for key, value in person.items():
        print(f"{key} : {value}")


"""
✅ Задание 7: Проверка наличия ключа
Есть словарь:

settings = {"звук": True, "яркость": 80}
Проверь, есть ли в нём ключ "звук", и выведи True или False.
"""


def primer_7():
    settings = {"яркость": True, "звук": 80}
    # name = set()
    # for key in settings:
    #     name.add(key)
    # TODO: Равносильно если написать settings.keys(). По умолчанию поиск происходит по ключу, поскольку он уникален. Можно сделать по значению через settings.values()
    print('звук' in settings)


"""
✅ Задание 8: Получение всех ключей и значений
Дан словарь:

movie = {"название": "Матрица", "режиссёр": "Вачовски", "год": 1999}
Выведи список всех ключей и список всех значений по отдельности.
"""


def primer_8():
    movie = {"название": "Матрица", "режиссёр": "Вачовски", "год": 1999}
    print(movie.keys())
    print(movie.values())


"""
✅ Задание 9: Подсчёт количества ключей
Есть словарь:

inventory = {"яблоко": 10, "банан": 5, "груша": 7}
Выведи количество элементов (пар ключ-значение) в словаре.
"""


def primer_9():
    inventory = {"яблоко": 10, "банан": 5, "груша": 7}
    print(len(inventory.keys()))


"""
✅ Задание 10: Условный вывод
Дан словарь:

marks = {"математика": 5, "физика": 4, "биология": 3}
Выведи только те предметы, где оценка 4 или выше.
"""


def primer_10():
    marks = {"математика": 5, "физика": 4, "биология": 3}
    # for key in marks:
    #     if marks[key] >= 4:
    #         print(f"Оценка по {key} равна {marks[key]}")
    # TODO: Как альтернатива
    for predmet, value in marks.items():
        if value >= 4:
            print(f"По {predmet} оценка: {value}")


"""
✅ Задание 11: Подсчёт повторений слов
Пользователь вводит строку слов.
Составь словарь, где ключ — слово, а значение — сколько раз оно встретилось.
"""


def primer_11():
    unik = dict()
    spisok = input("Вводи слова: ")
    v = spisok.split()
    k = set(v)
    for words in k:
        unik[words]

    # for value in k:
    #     unik[value] = k.count(value)
    #     print(unik[value])
    # for var in spisok:
    #     obem = spisok.count(var)
    #     s[var] = obem
primer_11()

"""
✅ Задание 12: Инвертирование словаря
Дан словарь:

cities = {"Москва": "Россия", "Париж": "Франция", "Берлин": "Германия"}
Сделай новый словарь, где ключами будут страны, а значениями — города.
"""


def primer_12():
    cities = {"Москва": "Россия", "Париж": "Франция", "Берлин": "Германия"}
    cities_new = dict()
    for city, country in cities.items():
        cities_new[country] = city
    print(cities_new)

