"""
Создай список из трёх любых животных. Затем выведи:

Первый элемент

Последний элемент (с помощью отрицательного индекса)
"""


def primer_1():
    a = ['Собака', 'Кошка', 'Лошадь']

    print(a[0])
    print(a[-1])


"""
Срезы:
numbers = [10, 20, 30, 40, 50]

print(numbers[1:4])   # элементы с индекса 1 до 3: [20, 30, 40]
print(numbers[:3])    # от начала до индекса 2: [10, 20, 30]
print(numbers[2:])    # от индекса 2 до конца: [30, 40, 50]
print(numbers[-3:])   # последние три элемента
"""

"""
Создай список из 5 чисел.
Выведи:

Первые 3 элемента с помощью среза

Последние 2 элемента с помощью среза
"""


def primer_2():
    a = [1, 2, 3, 4, 5]

    print(a[:3])
    print(a[-2:])


"""
Выведи срез, который включает только 20, 30 и 40.

"""


def primer_3():
    a = [10, 20, 30, 40, 50, 60]

    print(a[1:4])


"""
Выведи срез, который берёт каждый второй элемент, начиная с первого.
"""


def primer_4():
    b = ['a', 'b', 'c', 'd', 'e', 'f']

    print(b[1::2])


"""
Выведи элементы в обратном порядке, используя только срез.
"""


def primer_5():
    c = [1, 2, 3, 4, 5, 6, 7, 8]
    # c.reverse()
    # print(c)
    print(c[::-1])


"""
Методы списка
"""

"""
✅ Задание 1
Создай список из чисел [1, 2, 3].
Добавь в него число 4 с помощью append() и выведи результат.
"""


def primer_6():
    a = [1, 2, 3]
    a.append(4)
    print(a)


"""
✅ Задание 2
Создай список из элементов ['яблоко', 'банан', 'вишня', 'банан'].
Удалите первый элемент 'банан' методом remove() и выведи список.
"""


def primer_7():
    a = ['яблоко', 'банан', 'вишня', 'банан']
    a.remove('банан')
    print(a)


"""
✅ Задание 3
Создай список [10, 20, 30].
Удалите последний элемент с помощью pop() и выведите:

сначала удалённый элемент,

затем изменённый список.
"""


def primer_8():
    a = [10, 20, 30]
    b = a.pop()
    print(b)
    print(a)


"""
✅ Задание 4
Есть список [5, 2, 9, 1].
Отсортируй его по возрастанию методом sort() и выведи результат.
"""

def primer_9():
    a = [5, 2, 9, 1]
    a.sort()
    print(a)

"""
✅ Задание 5
Есть список ['зима', 'весна', 'лето', 'осень'].
Разверни его в обратном порядке методом reverse() и выведи результат.
"""

def primer_10():
    a = ['зима', 'весна', 'лето', 'осень']
    a.reverse()
    print(a)
