"""
✅ Задание 1: Уникальные элементы
Создай множество из списка с повторяющимися числами [1, 2, 2, 3, 3, 3, 4].
Выведи это множество.
"""


def primer_1():
    a = set([1, 2, 2, 3, 3, 3, 4])
    print(a)


"""
✅ Задание 2: Проверка наличия
Дано множество: a = {3, 5, 7, 9}
Проверь, есть ли в нем число 7.
Ожидаемый вывод: True или False.
"""


def primer_2():
    a = {3, 5, 7, 9}
    print(7 in a)


"""
✅ Задание 3: Добавление элемента
Создай пустое множество.
Добавь в него числа 10, 20, 30 с помощью .add().
Выведи результат.
"""


def primer_3():
    a = set()
    a.add(10)
    a.add(20)
    a.add(30)
    print(a)


"""
✅ Задание 4: Удаление элемента
Дано множество: a = {1, 2, 3, 4, 5}
Удалите из него число 3.
Выведи итоговое множество.
"""

def primer_4():
    a = {1, 2, 3, 4, 5}
    a.remove(3)
    print(a)

"""
✅ Задание 5: Объединение множеств
Дано два множества:
a = {1, 2, 3}
b = {3, 4, 5}
Создай третье множество, объединив их (a | b), и выведи его.
"""

def primer_5():
    a = {1, 2, 3}
    b = {3, 4, 5}
    print(a.union(b))

"""
✅ Задание 6: Пересечение
Найди, какие элементы есть и в a, и в b:
"""

def primer_6():
    a = {2, 4, 6, 8}
    b = {4, 5, 6, 7}
    print(a.intersection(b))

"""
✅ Задание 7: Разность
Найди, что есть в a, но нет в b:
"""

def primer_7():
    a = {10, 20, 30}
    b = {20, 40}
    print(a.difference(b))


"""
✅ Задание 8: Симметрическая разность
Найди элементы, которые есть только в одном из множеств, но не в обоих:
"""

def primer_8():
    a = {1, 2, 3}
    b = {3, 4, 5}
    print(a.symmetric_difference(b))

"""
✅ Задание 9: Подсчёт уникальных слов
Пользователь вводит строку слов, разделённых пробелом.
Выведи количество уникальных слов в строке.
"""

def primer_9():
    a= input("Вводи слова через пробел: ")
    text = a.split()
    set_fruit = set(text)
    print(len(set_fruit))
