"""
Пользователь вводит логин.
Если логин — admin, спроси возраст.
Если возраст больше или равен 18 — выведи: "Доступ разрешён",
иначе — "Тебе ещё нет 18".
Если логин неверный — "Неверный логин".
"""

def login_password_verification():
    login = input("Введите логин: ")

    if login == 'admin':
        age = int(input('Введите возраст: '))
        if age >= 18:
            print("Доступ разрешен")
        else:
            print("Тебе еще нет 18")
    else:
        print('Неверный логин')

login_password_verification()

"""
Пользователь вводит число.
Если число больше 0, проверь:

Если меньше 100, выведи: "Число в диапазоне от 1 до 99".

Иначе — "Число больше 99".
Если число не больше 0 — выведи: "Число меньше или равно 0".
"""

def number_in_range():
    value = float(input("Введите число: "))

    if value > 0:
        if value < 100:
            print("Число в диапазоне от 1 до 99")
        else:
            print('Число больше 99')
    else:
        print('Число меньше или равно 0')

number_in_range()

"""
Пользователь вводит число.
Если число чётное, проверь:

Делится ли оно на 4 без остатка.
Если да — выведи: "Число чётное и кратно 4".
Иначе — "Число чётное, но не кратно 4".
Если число нечётное — выведи: "Число нечётное".
"""

def  checking_parity_and_multiplicity():
    value = float(input("Введите число: "))

    if value%2==0:
        if value%4==0:
            print("Число чётное и кратно 4")
        else:
            print("Число чётное, но не кратно 4")
    else:
        print("Число нечётное")

checking_parity_and_multiplicity()

"""
Пользователь вводит логин и пароль.
Если логин — admin, проверь пароль.

Если пароль — 1234, выведи: "Добро пожаловать, admin!"

Иначе — "Неверный пароль"
Если логин не admin, выведи: "Нет доступа".
"""

def access_verification():
    login = input('Введите логин: ')
    password = input('Введите пароль')

    if login == 'admin':
        if password == '1234':
            print('Добро пожаловать, admin!')
        else:
            print('Неверный пароль')
    else:
        print('Нет доступа')

access_verification()

"""
Пользователь вводит возраст и оценку (0–100).
Если возраст меньше 18:

Если оценка >= 80 — выведи: "Молодец, юный гений!"

Иначе — "Старайся лучше, ещё есть время"

Если возраст 18 или больше:

Если оценка >= 80 — "Отличный результат!"

Иначе — "Нужно подтянуть знания"

"""


def assessment_and_age():
    age = int(input("Введите возраст: "))
    ball = float(input("Введите балл: "))

    if age < 18:
        if ball >= 80:
            print("Молодец, юный гений!")
        else:
            print("Старайся лучше, ещё есть время")
    if age >= 18:
        if ball >= 80:
            print("Отличный результат!")
        else:
            print("Нужно подтянуть знания")

assessment_and_age()

"""
Пользователь вводит три числа.

Если все три числа положительные — вывести «Все числа положительные».

Если хотя бы одно число отрицательное — вывести «Есть отрицательное число».

Если есть хотя бы одно число равно нулю — вывести «Есть ноль».
"""


def checking_three_numbers():
    one = float(input('Введи первое число'))
    two = float(input('Введи второе число'))
    three = float(input('Введи третье число'))

    if one == 0 or two == 0 or three == 0:
        print('Есть ноль')
    if one < 0 or two < 0 or three < 0:
        print('Есть отрицательное число')
    if one > 0 and two > 0 and three > 0:
        print('Все числа положительные')


checking_three_numbers()


"""
Пользователь вводит пароль.

Если длина пароля меньше 8 символов — вывести «Пароль слишком короткий».

Иначе, если пароль содержит хотя бы одну цифру — вывести «Пароль принят».

Иначе — вывести «Пароль должен содержать хотя бы одну цифру».
"""


def password_verification():
    password = input('Введите пароль')

    if len(password) < 8:
        print('Пароль слишком короткий')
    else:
        # Функция isdigit() проверяет является ли символ числом от 0 до 9
        if any(char.isdigit() for char in password):
            print('Пароль принят')
        else:
            print('Пароль должен содержать хотя бы одну цифру')


password_verification()

"""
Пользователь вводит номер месяца (1–12).

Если месяц — зимний (12, 1, 2) — вывести «Зима».

Если весенний (3, 4, 5) — вывести «Весна».

Если летний (6, 7, 8) — вывести «Лето».

Если осенний (9, 10, 11) — вывести «Осень».

Если введено число вне диапазона 1–12 — вывести «Некорректный номер месяца».
"""

def calendar():
    number = int(input('Введи номер месяца: '))

    if number in (12,1,2):
        print('Зима')
    elif number in (3,4,5):
        print('Весна')
    elif number in (6,7,8):
        print('Лето')
    elif number in (9,10,11):
        print('Осень')
    else:
        print('Некорректный номер месяца')

calendar()