"""
Пользователь вводит логин.
Если логин — admin, спроси возраст.
Если возраст больше или равен 18 — выведи: "Доступ разрешён",
иначе — "Тебе ещё нет 18".
Если логин неверный — "Неверный логин".
"""

def login_password_verification():
    login = input("Введите логин: ")

    if login == 'admin':
        age = int(input('Введите возраст: '))
        if age >= 18:
            print("Доступ разрешен")
        else:
            print("Тебе еще нет 18")
    else:
        print('Неверный логин')

login_password_verification()

"""
Пользователь вводит число.
Если число больше 0, проверь:

Если меньше 100, выведи: "Число в диапазоне от 1 до 99".

Иначе — "Число больше 99".
Если число не больше 0 — выведи: "Число меньше или равно 0".
"""

def number_in_range():
    value = float(input("Введите число: "))

    if value > 0:
        if value < 100:
            print("Число в диапазоне от 1 до 99")
        else:
            print('Число больше 99')
    else:
        print('Число меньше или равно 0')

number_in_range()

"""
Пользователь вводит число.
Если число чётное, проверь:

Делится ли оно на 4 без остатка.
Если да — выведи: "Число чётное и кратно 4".
Иначе — "Число чётное, но не кратно 4".
Если число нечётное — выведи: "Число нечётное".
"""

def  checking_parity_and_multiplicity():
    value = float(input("Введите число: "))

    if value%2==0:
        if value%4==0:
            print("Число чётное и кратно 4")
        else:
            print("Число чётное, но не кратно 4")
    else:
        print("Число нечётное")

checking_parity_and_multiplicity()

"""
Пользователь вводит логин и пароль.
Если логин — admin, проверь пароль.

Если пароль — 1234, выведи: "Добро пожаловать, admin!"

Иначе — "Неверный пароль"
Если логин не admin, выведи: "Нет доступа".
"""

def access_verification():
    login = input('Введите логин: ')
    password = input('Введите пароль')

    if login == 'admin':
        if password == '1234':
            print('Добро пожаловать, admin!')
        else:
            print('Неверный пароль')
    else:
        print('Нет доступа')

access_verification()

"""
Пользователь вводит возраст и оценку (0–100).
Если возраст меньше 18:

Если оценка >= 80 — выведи: "Молодец, юный гений!"

Иначе — "Старайся лучше, ещё есть время"

Если возраст 18 или больше:

Если оценка >= 80 — "Отличный результат!"

Иначе — "Нужно подтянуть знания"

"""


def assessment_and_age():
    age = int(input("Введите возраст: "))
    ball = float(input("Введите балл: "))

    if age < 18:
        if ball >= 80:
            print("Молодец, юный гений!")
        else:
            print("Старайся лучше, ещё есть время")
    if age >= 18:
        if ball >= 80:
            print("Отличный результат!")
        else:
            print("Нужно подтянуть знания")

assessment_and_age()
