"""
Создай код, который:

Создаёт переменную name

Просит пользователя ввести своё имя

Выводит приветствие
"""
# Вывожу приветсвие
print('Напиши своё имя')
# Указываю команду input, которая получает на вход текст из консоли и кладет его в перменную name
#name = input()
# Вывожу приветсвие, указывая текст из перменной
# print('Привет, ' + name + '!')
print("-----------")

"""
Создай скрипт, где:

Считается квадрат числа

А в комментарии указывается TODO: сделать проверку, что ввод — это число
"""
a=3
#TODO: Сделать проверку, что ввод это число
kv = a**2
print(kv)