"""
Пользователь вводит числа. Прерывать ввод, когда введено отрицательное число (break)
"""


def primer_1():
    while True:
        a = int(input("Введите число: "))
        if a < 0:
            print('Введено отрицательное число')
            break


"""
Выводить только нечётные числа от 1 до 10, пропуская чётные (continue).
"""


def primer_2():
    for i in range(1, 11):
        if i % 2 == 0:
            continue
        print(i)


"""
Ввести число N. Перебрать от 2 до N, найти первое, на которое N делится без остатка (не считая 1), и остановиться.
"""


def primer_3():
    a = int(input("Введите число: "))

    for i in range(2, a + 1):
        if a % i == 0:
            print(f'Первое число на которое {a} делится без остатка: {i}')
            break


"""
Пользователь вводит 5 чисел, но в сумму идут только положительные (отрицательные — пропускаются с continue).
"""


def primer_4():
    summa = 0
    for i in range(5):
        a = int(input("Введите число: "))
        if a < 0:
            continue
        summa += a
    print(summa)
