"""
Выведи числа от 1 до 10 включительно с помощью for.
"""


def primer_1():
    for i in range(1, 11):
        print(i)


"""
Выведи квадраты чисел от 1 до 5.
Подсказка: квадрат числа — это i ** 2.
"""


def primer_2():
    for i in range(1, 6):
        print(i ** 2)


"""
Выведи все чётные числа от 2 до 20 включительно.
"""


def primer_3():
    for i in range(2, 21):
        if i % 2 == 0:
            print(i)


"""
Пользователь вводит 5 чисел. Выведи их сумму.
"""


def primer_4():
    summa = 0
    for i in range(1, 6):
        a = float(input("Введите число: "))
        summa += a
    print(summa)


"""
Выведи символы строки по одному в столбик.
"""


def primer_5():
    a = 'primer'
    for p in a:
        print(p)


"""
Задачи сложнее
"""

"""
Выведи сумму всех нечётных чисел в диапазоне от 1 до 100 включительно.
"""


def primer_6():
    summa = 0
    for i in range(1, 101):
        if i % 2 != 0:
            summa += i
    print(summa)


"""
Пользователь вводит число. Выведи таблицу умножения для него от 1 до 10.
"""


def primer_7():
    a = int(input("Введи число: "))
    for i in range(1, 11):
        mnog = a * i
        print(f'{a} * {i} = {mnog}')


"""
Пользователь вводит строку. Посчитай, сколько в ней гласных букв (а, е, ё, и, о, у, ы, э, ю, я, учитывая и строчные, и прописные).
"""


def primer_8():
    a = input("Введи текст на русском: ")
    glass = 0
    lower = 'аеёиоуыэюя'

    for b in a:
        if b.lower() in lower:
            glass += 1

    print(glass)


"""
Пользователь вводит ширину и высоту. Построй прямоугольник из # вида
"""


def primer_9():
    h = int(input('Введи высоту: '))
    d = int(input('Введи длину: '))

    # Таким образом можно сократить код. Отсчет будет с 0
    for i in range(h):
        print('# ' * d)


"""
Пользователь вводит число n. Выведи n! (произведение всех чисел от 1 до n).
"""


def primer_10():
    a = int(input("Введите число: "))
    proiz = 1
    for i in range(1, a + 1):
        proiz *= i
    print(proiz)
